###################################################################

# Created by write_sdc on Wed Dec 13 16:40:01 2017

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -power mW -voltage V       \
-current mA
set_driving_cell -lib_cell inv_1 [get_ports clk]
set_driving_cell -lib_cell inv_1 [get_ports reset]
set_driving_cell -lib_cell inv_1 [get_ports inputSramWe]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[89]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[88]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[87]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[86]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[85]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[84]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[83]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[82]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[81]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[80]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[79]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[78]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[77]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[76]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[75]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[74]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[73]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[72]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[71]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[70]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[69]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[68]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[67]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[66]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[65]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[64]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[63]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[62]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[61]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[60]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[59]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[58]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[57]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[56]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[55]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[54]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[53]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[52]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[51]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[50]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[49]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[48]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[47]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[46]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[45]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[44]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[43]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[42]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[41]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[40]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[39]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[38]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[37]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[36]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[35]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[34]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[33]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[32]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {pixels[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight1[0]}]
set_driving_cell -lib_cell inv_1 [get_ports w2SramWeOffChip]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2AddrOffChip[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2AddrOffChip[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2AddrOffChip[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {weight2AddrOffChip[0]}]
set_load -pin_load 57.462 [get_ports {rdata[15]}]
set_load -pin_load 57.462 [get_ports {rdata[14]}]
set_load -pin_load 57.462 [get_ports {rdata[13]}]
set_load -pin_load 57.462 [get_ports {rdata[12]}]
set_load -pin_load 57.462 [get_ports {rdata[11]}]
set_load -pin_load 57.462 [get_ports {rdata[10]}]
set_load -pin_load 57.462 [get_ports {rdata[9]}]
set_load -pin_load 57.462 [get_ports {rdata[8]}]
set_load -pin_load 57.462 [get_ports {rdata[7]}]
set_load -pin_load 57.462 [get_ports {rdata[6]}]
set_load -pin_load 57.462 [get_ports {rdata[5]}]
set_load -pin_load 57.462 [get_ports {rdata[4]}]
set_load -pin_load 57.462 [get_ports {rdata[3]}]
set_load -pin_load 57.462 [get_ports {rdata[2]}]
set_load -pin_load 57.462 [get_ports {rdata[1]}]
set_load -pin_load 57.462 [get_ports {rdata[0]}]
create_clock [get_ports clk]  -period 50000  -waveform {0 25000}
